Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АкцизныйНалог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитическаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитическиеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безнадбавочный</Name>
					<Comment>На товар не распространяются никакие надбавки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безскидочный</Name>
					<Comment>На товар не распространяются ни какие скидки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСравнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Comment>Весовой товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Временной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаБлюда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыБлюд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заменяемый</Name>
					<Comment>Товар заменяется в чеке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяКомплектами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяМодификаторами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяТоварами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяУсловиями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЕдиницыИзмеренияДляОтчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоМодификаторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миниатюра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеВремяЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественныйВыборМодификаторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модифицируемый</Name>
					<Comment>Блюдо имеет неотъемлемый модификатор</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Набор</Name>
					<Comment>Набор товаров и блюд</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Comment>Краткое наименование, для ККМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Принтер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПенсионныйФонд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Печатаемый</Name>
					<Comment>Печать товара в пречеке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторениеМодификаторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Связана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС для данного товара</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Все виды услуг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточняемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлИзображения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценовой</Name>
					<Comment>Товар имеющий цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штучный</Name>
					<Comment>Штучный товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/МодификаторыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>МодификаторыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МодификаторыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УсловияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>УсловияНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/МодификаторыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>МодификаторыНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миниатюра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура/Ext/ManagerModule.bsl
Функция ПолучитьСписокРодителейПоИерархии(Номенклатура) Экспорт
	
	//Если НЕ ЗначениеЗаполнено(Номенклатура.Родитель) Тогда
	//	Возврат Номенклатура;
	//КонецЕсли;
	//
	//Массив = Новый Массив;
	//Массив.Добавить(Номенклатура);
	//ТекущаяНоменклатура = Номенклатура;
	//Пока ЗначениеЗаполнено(ТекущаяНоменклатура.Родитель) Цикл
	//	ТекущаяНоменклатура = ТекущаяНоменклатура.Родитель;
	//	Массив.Добавить(ТекущаяНоменклатура);
	//КонецЦикла;
	//Возврат Массив;
	Возврат ОбщегоНазначенияСервер.ПолучитьСписокИерархииССылки(Номенклатура) ;
	
КонецФункции

Процедура ЗаполнитьРекурсивноДерево(Строка)
	
	СтрокаРодитель = Строка.Родитель;
	
	Если НЕ Строка.АктуальностьВРегистре Тогда
		Строка.Актуальность = ?(СтрокаРодитель=Неопределено,Ложь,СтрокаРодитель.Актуальность);
	КонецЕсли;
	
	Если Строка.ЭтоГруппа Тогда
		Строка.Картинка = БиблиотекаКартинок.TouchИерархияРодитель;
	Иначе
		Строка.Картинка = БиблиотекаКартинок.TouchИерархияЭлеменит;
	КонецЕсли;
	
	Для Каждого ПодчиненнаяСтрока ИЗ Строка.Строки Цикл
		ЗаполнитьРекурсивноДерево(ПодчиненнаяСтрока);
	Конеццикла;
	
КонецПроцедуры

Процедура ОбновитьРекурсивноДерево(Строка)
	
	СтрокаРодитель		= Строка.Родитель;
	Строка.Актуальность = ?(СтрокаРодитель=Неопределено,Ложь,СтрокаРодитель.Актуальность);
	
	Для Каждого ПодчиненнаяСтрока ИЗ Строка.Строки Цикл
		ОбновитьРекурсивноДерево(ПодчиненнаяСтрока);
	Конеццикла;
	
КонецПроцедуры

Процедура ОбновитьДерево(Дерево, Номенклатура, ИмяРегистра, ИмяРеквизита)
	
	Текст =
	"ВЫБРАТЬ
	|	Регистр.Актуальность,
	|	Регистр.Модификатор КАК Поле
	|ИЗ
	|	РегистрСведений.МодификаторыНоменклатуры КАК Регистр
	|ГДЕ
	|	Регистр.Номенклатура = &Номенклатура";
	
	Текст = СтрЗаменить(Текст,"РегистрСведений.МодификаторыНоменклатуры","РегистрСведений."+ИмяРегистра);
	Текст = СтрЗаменить(Текст,"Регистр.Модификатор","Регистр."+ИмяРеквизита);
	
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Строка = Дерево.Строки.Найти(Выборка.Поле,"Модификатор",Истина);
		Если Строка<>Неопределено Тогда
			Строка.Актуальность			= Выборка.Актуальность;
			Для Каждого ПодчиненнаяСтрока ИЗ Строка.Строки Цикл
				ОбновитьРекурсивноДерево(ПодчиненнаяСтрока);
			Конеццикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьДеревоПервогоЭлемента(Номенклатура, ИмяРегистра, ИмяРеквизита)
	
	Текст =
	"ВЫБРАТЬ
	|	Данные.Ссылка КАК Модификатор,
	|	Регистр.Актуальность,
	|	ВЫБОР
	|		КОГДА Регистр.Актуальность ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК АктуальностьВРегистре,
	|	Данные.ЭтоГруппа
	|ИЗ
	|	Справочник.МодификаторыНоменклатуры КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МодификаторыНоменклатуры КАК Регистр
	|		ПО Данные.Ссылка = Регистр.Модификатор
	|			И (Регистр.Номенклатура = &Номенклатура)
	|ГДЕ
	|	Данные.Актуальность
	|	И (НЕ Данные.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Модификатор ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Текст = СтрЗаменить(Текст,"РегистрСведений.МодификаторыНоменклатуры","РегистрСведений."+ИмяРегистра);
	Текст = СтрЗаменить(Текст,"Справочник.МодификаторыНоменклатуры","Справочник."+ИмяРегистра);
	Текст = СтрЗаменить(Текст,"Данные.Модификатор","Данные."+ИмяРеквизита);
	Текст = СтрЗаменить(Текст,"Регистр.Модификатор","Регистр."+ИмяРеквизита);
	
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	ДеревоЗначение = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ДеревоЗначение.Колонки.Добавить("Картинка");
	
	Для Каждого ПодчиненнаяСтрока ИЗ ДеревоЗначение.Строки Цикл
		ЗаполнитьРекурсивноДерево(ПодчиненнаяСтрока);
	Конеццикла;
	
	Возврат ДеревоЗначение;
	
КонецФункции

Функция СоздатьДерево(Номенклатура, ИмяРегистра, ИмяРеквизита)
	
	Массив = ПолучитьСписокРодителейПоИерархии(Номенклатура);
	Если ТипЗнч(Массив)<>Тип("Массив") ИЛИ Массив.Количество()=0 Тогда
		Возврат СоздатьДеревоПервогоЭлемента(Номенклатура, ИмяРегистра, ИмяРеквизита);
	КонецЕсли;
	
	Индекс = Массив.ВГраница();
	Дерево = СоздатьДеревоПервогоЭлемента(Массив[Индекс], ИмяРегистра, ИмяРеквизита);
	Индекс = Индекс - 1;
	Пока Индекс>=0 Цикл
		ОбновитьДерево(Дерево,Массив[Индекс],ИмяРегистра,ИмяРеквизита);
		Индекс = Индекс -1;
	КонецЦикла;
	
	Возврат Дерево;
	
КонецФункции

Функция ПрочитатьЗаписиРегистра(ИмяРегистра,Ссылка) Экспорт
	
	Массив = ПолучитьСписокРодителейПоИерархии(Ссылка);
	
	Если ТипЗнч(Массив)=Тип("Массив") Тогда
		
		Массив.Удалить(0);
		
		Текст = 
		"ВЫБРАТЬ
		|	УсловияНоменклатуры.Номенклатура,
		|	УсловияНоменклатуры.Условия КАК Модификатор,
		|	УсловияНоменклатуры.Актуальность КАК Актуальность
		|ИЗ
		|	РегистрСведений.УсловияНоменклатуры КАК УсловияНоменклатуры
		|ГДЕ
		|	УсловияНоменклатуры.Номенклатура В(&Номенклатура)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Актуальность УБЫВ";
		Текст = СтрЗаменить(Текст,"РегистрСведений.УсловияНоменклатуры","РегистрСведений."+ИмяРегистра);
		Текст = СтрЗаменить(Текст,"УсловияНоменклатуры.Условия","УсловияНоменклатуры."+?(ИмяРегистра="УсловияНоменклатуры","Условия","Модификатор"));
		
		Запрос = Новый Запрос(Текст);
		Запрос.УстановитьПараметр("Номенклатура",Массив);
		Возврат Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Результат = Новый ТаблицаЗначений;
		Результат.Колонки.Добавить("Номенклатура");
		Результат.Колонки.Добавить("Модификатор");
		Результат.Колонки.Добавить("Актуальность");
		
		Возврат Результат;

	КонецЕсли; 
	
КонецФункции

Функция СоздатьДеревоМодификаторов(Номенклатура) Экспорт
	
	Возврат СоздатьДерево(Номенклатура,"МодификаторыНоменклатуры","Модификатор");
	
КонецФункции

Функция СоздатьДеревоУсловийПриготовления(Номенклатура) Экспорт
	
	Возврат СоздатьДерево(Номенклатура,"УсловияНоменклатуры","Условия");
	
КонецФункции

Функция ИспользуетсяМодификатор(Номенклатура,Модификатор) Экспорт
	
	МассивМодификаторов = ОбщегоНазначенияСервер.ПолучитьСписокИерархииССылки(Модификатор, "МодификаторыНоменклатуры");
	МассивНоменклатуры = ПолучитьСписокРодителейПоИерархии(Номенклатура);
	
	Для Каждого РодительНоменклатуры Из МассивНоменклатуры Цикл
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Данные.Актуальность
		|ИЗ
		|	РегистрСведений.МодификаторыНоменклатуры КАК Данные
		|ГДЕ
		|	Данные.Номенклатура = &Номенклатура
		|	И Данные.Модификатор = &Модификатор"
		);
		Запрос.УстановитьПараметр("Номенклатура",РодительНоменклатуры);
		
		Для Каждого Строка Из МассивМодификаторов Цикл
			Запрос.УстановитьПараметр("Модификатор",Строка);
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				Возврат Результат.Актуальность;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ИспользуетсяУсловие(Номенклатура,Модификатор) Экспорт
	
	МассивМодификаторов = ПолучитьСписокРодителейПоИерархии(Модификатор);
	МассивНоменклатуры = ПолучитьСписокРодителейПоИерархии(Номенклатура);
	
	Для Каждого РодительНоменклатуры Из МассивНоменклатуры Цикл
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Данные.Актуальность
		|ИЗ
		|	РегистрСведений.УсловияНоменклатуры КАК Данные
		|ГДЕ
		|	Данные.Номенклатура = &Номенклатура
		|	И Данные.Условия = &Модификатор"
		);
		Запрос.УстановитьПараметр("Номенклатура",РодительНоменклатуры);
		
		Для Каждого Строка Из МассивМодификаторов Цикл
			Запрос.УстановитьПараметр("Модификатор",Строка);
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				Возврат Результат.Актуальность;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


// Рефакторинг: 
//	1. Удалить "Версия", "Период", "ИмяФайла", "ФайлИзображения", "Версия";
//	2. Переименовать "МножественныйВыборМодификаторов" в "МодифицируемыйМножественно".
